###################################################################

# Created by write_sdc on Thu Dec 5 13:11:12 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.15 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports clk]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports start]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports reset_n]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {rad[0]}]
set_load -pin_load 0.3 [get_ports busy]
set_load -pin_load 0.3 [get_ports valid]
set_load -pin_load 0.3 [get_ports {root[15]}]
set_load -pin_load 0.3 [get_ports {root[14]}]
set_load -pin_load 0.3 [get_ports {root[13]}]
set_load -pin_load 0.3 [get_ports {root[12]}]
set_load -pin_load 0.3 [get_ports {root[11]}]
set_load -pin_load 0.3 [get_ports {root[10]}]
set_load -pin_load 0.3 [get_ports {root[9]}]
set_load -pin_load 0.3 [get_ports {root[8]}]
set_load -pin_load 0.3 [get_ports {root[7]}]
set_load -pin_load 0.3 [get_ports {root[6]}]
set_load -pin_load 0.3 [get_ports {root[5]}]
set_load -pin_load 0.3 [get_ports {root[4]}]
set_load -pin_load 0.3 [get_ports {root[3]}]
set_load -pin_load 0.3 [get_ports {root[2]}]
set_load -pin_load 0.3 [get_ports {root[1]}]
set_load -pin_load 0.3 [get_ports {root[0]}]
set_load -pin_load 0.3 [get_ports {rem[15]}]
set_load -pin_load 0.3 [get_ports {rem[14]}]
set_load -pin_load 0.3 [get_ports {rem[13]}]
set_load -pin_load 0.3 [get_ports {rem[12]}]
set_load -pin_load 0.3 [get_ports {rem[11]}]
set_load -pin_load 0.3 [get_ports {rem[10]}]
set_load -pin_load 0.3 [get_ports {rem[9]}]
set_load -pin_load 0.3 [get_ports {rem[8]}]
set_load -pin_load 0.3 [get_ports {rem[7]}]
set_load -pin_load 0.3 [get_ports {rem[6]}]
set_load -pin_load 0.3 [get_ports {rem[5]}]
set_load -pin_load 0.3 [get_ports {rem[4]}]
set_load -pin_load 0.3 [get_ports {rem[3]}]
set_load -pin_load 0.3 [get_ports {rem[2]}]
set_load -pin_load 0.3 [get_ports {rem[1]}]
set_load -pin_load 0.3 [get_ports {rem[0]}]
set_max_transition 0.08 [get_ports busy]
set_max_transition 0.08 [get_ports valid]
set_max_transition 0.08 [get_ports {root[15]}]
set_max_transition 0.08 [get_ports {root[14]}]
set_max_transition 0.08 [get_ports {root[13]}]
set_max_transition 0.08 [get_ports {root[12]}]
set_max_transition 0.08 [get_ports {root[11]}]
set_max_transition 0.08 [get_ports {root[10]}]
set_max_transition 0.08 [get_ports {root[9]}]
set_max_transition 0.08 [get_ports {root[8]}]
set_max_transition 0.08 [get_ports {root[7]}]
set_max_transition 0.08 [get_ports {root[6]}]
set_max_transition 0.08 [get_ports {root[5]}]
set_max_transition 0.08 [get_ports {root[4]}]
set_max_transition 0.08 [get_ports {root[3]}]
set_max_transition 0.08 [get_ports {root[2]}]
set_max_transition 0.08 [get_ports {root[1]}]
set_max_transition 0.08 [get_ports {root[0]}]
set_max_transition 0.08 [get_ports {rem[15]}]
set_max_transition 0.08 [get_ports {rem[14]}]
set_max_transition 0.08 [get_ports {rem[13]}]
set_max_transition 0.08 [get_ports {rem[12]}]
set_max_transition 0.08 [get_ports {rem[11]}]
set_max_transition 0.08 [get_ports {rem[10]}]
set_max_transition 0.08 [get_ports {rem[9]}]
set_max_transition 0.08 [get_ports {rem[8]}]
set_max_transition 0.08 [get_ports {rem[7]}]
set_max_transition 0.08 [get_ports {rem[6]}]
set_max_transition 0.08 [get_ports {rem[5]}]
set_max_transition 0.08 [get_ports {rem[4]}]
set_max_transition 0.08 [get_ports {rem[3]}]
set_max_transition 0.08 [get_ports {rem[2]}]
set_max_transition 0.08 [get_ports {rem[1]}]
set_max_transition 0.08 [get_ports {rem[0]}]
group_path -name FEEDTHROUGH  -from [list [get_ports clk] [get_ports start] [get_ports reset_n] [get_ports {rad[15]}] [get_ports {rad[14]}] [get_ports {rad[13]}] [get_ports {rad[12]}] [get_ports {rad[11]}] [get_ports {rad[10]}] [get_ports {rad[9]}] [get_ports {rad[8]}] [get_ports {rad[7]}] [get_ports {rad[6]}] [get_ports {rad[5]}] [get_ports {rad[4]}] [get_ports {rad[3]}] [get_ports {rad[2]}] [get_ports {rad[1]}] [get_ports {rad[0]}]]  -to [list [get_ports busy] [get_ports valid] [get_ports {root[15]}] [get_ports {root[14]}] [get_ports {root[13]}] [get_ports {root[12]}] [get_ports {root[11]}] [get_ports {root[10]}] [get_ports {root[9]}] [get_ports {root[8]}] [get_ports {root[7]}] [get_ports {root[6]}] [get_ports {root[5]}] [get_ports {root[4]}] [get_ports {root[3]}] [get_ports {root[2]}] [get_ports {root[1]}] [get_ports {root[0]}] [get_ports {rem[15]}] [get_ports {rem[14]}] [get_ports {rem[13]}] [get_ports {rem[12]}] [get_ports {rem[11]}] [get_ports {rem[10]}] [get_ports {rem[9]}] [get_ports {rem[8]}] [get_ports {rem[7]}] [get_ports {rem[6]}] [get_ports {rem[5]}] [get_ports {rem[4]}] [get_ports {rem[3]}] [get_ports {rem[2]}] [get_ports {rem[1]}] [get_ports {rem[0]}]]
group_path -name REGIN  -from [list [get_ports clk] [get_ports start] [get_ports reset_n] [get_ports {rad[15]}] [get_ports {rad[14]}] [get_ports {rad[13]}] [get_ports {rad[12]}] [get_ports {rad[11]}] [get_ports {rad[10]}] [get_ports {rad[9]}] [get_ports {rad[8]}] [get_ports {rad[7]}] [get_ports {rad[6]}] [get_ports {rad[5]}] [get_ports {rad[4]}] [get_ports {rad[3]}] [get_ports {rad[2]}] [get_ports {rad[1]}] [get_ports {rad[0]}]]
group_path -name REGOUT  -to [list [get_ports busy] [get_ports valid] [get_ports {root[15]}] [get_ports {root[14]}] [get_ports {root[13]}] [get_ports {root[12]}] [get_ports {root[11]}] [get_ports {root[10]}] [get_ports {root[9]}] [get_ports {root[8]}] [get_ports {root[7]}] [get_ports {root[6]}] [get_ports {root[5]}] [get_ports {root[4]}] [get_ports {root[3]}] [get_ports {root[2]}] [get_ports {root[1]}] [get_ports {root[0]}] [get_ports {rem[15]}] [get_ports {rem[14]}] [get_ports {rem[13]}] [get_ports {rem[12]}] [get_ports {rem[11]}] [get_ports {rem[10]}] [get_ports {rem[9]}] [get_ports {rem[8]}] [get_ports {rem[7]}] [get_ports {rem[6]}] [get_ports {rem[5]}] [get_ports {rem[4]}] [get_ports {rem[3]}] [get_ports {rem[2]}] [get_ports {rem[1]}] [get_ports {rem[0]}]]
