###################################################################

# Created by write_sdc on Thu Dec 5 17:54:40 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.15 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports clk]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports rst]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports start]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {a[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {b[0]}]
set_load -pin_load 0.3 [get_ports busy]
set_load -pin_load 0.3 [get_ports done]
set_load -pin_load 0.3 [get_ports valid]
set_load -pin_load 0.3 [get_ports dbz]
set_load -pin_load 0.3 [get_ports ovf]
set_load -pin_load 0.3 [get_ports {val[15]}]
set_load -pin_load 0.3 [get_ports {val[14]}]
set_load -pin_load 0.3 [get_ports {val[13]}]
set_load -pin_load 0.3 [get_ports {val[12]}]
set_load -pin_load 0.3 [get_ports {val[11]}]
set_load -pin_load 0.3 [get_ports {val[10]}]
set_load -pin_load 0.3 [get_ports {val[9]}]
set_load -pin_load 0.3 [get_ports {val[8]}]
set_load -pin_load 0.3 [get_ports {val[7]}]
set_load -pin_load 0.3 [get_ports {val[6]}]
set_load -pin_load 0.3 [get_ports {val[5]}]
set_load -pin_load 0.3 [get_ports {val[4]}]
set_load -pin_load 0.3 [get_ports {val[3]}]
set_load -pin_load 0.3 [get_ports {val[2]}]
set_load -pin_load 0.3 [get_ports {val[1]}]
set_load -pin_load 0.3 [get_ports {val[0]}]
set_max_transition 0.08 [get_ports busy]
set_max_transition 0.08 [get_ports done]
set_max_transition 0.08 [get_ports valid]
set_max_transition 0.08 [get_ports dbz]
set_max_transition 0.08 [get_ports ovf]
set_max_transition 0.08 [get_ports {val[15]}]
set_max_transition 0.08 [get_ports {val[14]}]
set_max_transition 0.08 [get_ports {val[13]}]
set_max_transition 0.08 [get_ports {val[12]}]
set_max_transition 0.08 [get_ports {val[11]}]
set_max_transition 0.08 [get_ports {val[10]}]
set_max_transition 0.08 [get_ports {val[9]}]
set_max_transition 0.08 [get_ports {val[8]}]
set_max_transition 0.08 [get_ports {val[7]}]
set_max_transition 0.08 [get_ports {val[6]}]
set_max_transition 0.08 [get_ports {val[5]}]
set_max_transition 0.08 [get_ports {val[4]}]
set_max_transition 0.08 [get_ports {val[3]}]
set_max_transition 0.08 [get_ports {val[2]}]
set_max_transition 0.08 [get_ports {val[1]}]
set_max_transition 0.08 [get_ports {val[0]}]
group_path -name FEEDTHROUGH  -from [list [get_ports clk] [get_ports rst] [get_ports start] [get_ports {a[15]}] [get_ports {a[14]}] [get_ports {a[13]}] [get_ports {a[12]}] [get_ports {a[11]}] [get_ports {a[10]}] [get_ports {a[9]}] [get_ports {a[8]}] [get_ports {a[7]}] [get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[15]}] [get_ports {b[14]}] [get_ports {b[13]}] [get_ports {b[12]}] [get_ports {b[11]}] [get_ports {b[10]}] [get_ports {b[9]}] [get_ports {b[8]}] [get_ports {b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}]]  -to [list [get_ports busy] [get_ports done] [get_ports valid] [get_ports dbz] [get_ports ovf] [get_ports {val[15]}] [get_ports {val[14]}] [get_ports {val[13]}] [get_ports {val[12]}] [get_ports {val[11]}] [get_ports {val[10]}] [get_ports {val[9]}] [get_ports {val[8]}] [get_ports {val[7]}] [get_ports {val[6]}] [get_ports {val[5]}] [get_ports {val[4]}] [get_ports {val[3]}] [get_ports {val[2]}] [get_ports {val[1]}] [get_ports {val[0]}]]
group_path -name REGIN  -from [get_ports rst]
group_path -name REGIN  -from [list [get_ports clk] [get_ports start] [get_ports {a[15]}] [get_ports {a[14]}] [get_ports {a[13]}] [get_ports {a[12]}] [get_ports {a[11]}] [get_ports {a[10]}] [get_ports {a[9]}] [get_ports {a[8]}] [get_ports {a[7]}] [get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[15]}] [get_ports {b[14]}] [get_ports {b[13]}] [get_ports {b[12]}] [get_ports {b[11]}] [get_ports {b[10]}] [get_ports {b[9]}] [get_ports {b[8]}] [get_ports {b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}]]
group_path -name REGOUT  -to [list [get_ports busy] [get_ports done] [get_ports valid] [get_ports dbz] [get_ports ovf] [get_ports {val[15]}] [get_ports {val[14]}] [get_ports {val[13]}] [get_ports {val[12]}] [get_ports {val[11]}] [get_ports {val[10]}] [get_ports {val[9]}] [get_ports {val[8]}] [get_ports {val[7]}] [get_ports {val[6]}] [get_ports {val[5]}] [get_ports {val[4]}] [get_ports {val[3]}] [get_ports {val[2]}] [get_ports {val[1]}] [get_ports {val[0]}]]
set_false_path   -from [get_ports rst]
