###################################################################

# Created by write_sdc on Thu Dec 5 16:56:16 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.15 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_dividend[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {i_divisor[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports i_start]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports i_clk]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports i_reset_n]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports i_enable]
set_load -pin_load 0.3 [get_ports {o_quotient_out[15]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[14]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[13]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[12]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[11]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[10]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[9]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[8]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[7]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[6]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[5]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[4]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[3]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[2]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[1]}]
set_load -pin_load 0.3 [get_ports {o_quotient_out[0]}]
set_load -pin_load 0.3 [get_ports o_complete]
set_load -pin_load 0.3 [get_ports o_overflow]
set_max_transition 0.08 [get_ports {o_quotient_out[15]}]
set_max_transition 0.08 [get_ports {o_quotient_out[14]}]
set_max_transition 0.08 [get_ports {o_quotient_out[13]}]
set_max_transition 0.08 [get_ports {o_quotient_out[12]}]
set_max_transition 0.08 [get_ports {o_quotient_out[11]}]
set_max_transition 0.08 [get_ports {o_quotient_out[10]}]
set_max_transition 0.08 [get_ports {o_quotient_out[9]}]
set_max_transition 0.08 [get_ports {o_quotient_out[8]}]
set_max_transition 0.08 [get_ports {o_quotient_out[7]}]
set_max_transition 0.08 [get_ports {o_quotient_out[6]}]
set_max_transition 0.08 [get_ports {o_quotient_out[5]}]
set_max_transition 0.08 [get_ports {o_quotient_out[4]}]
set_max_transition 0.08 [get_ports {o_quotient_out[3]}]
set_max_transition 0.08 [get_ports {o_quotient_out[2]}]
set_max_transition 0.08 [get_ports {o_quotient_out[1]}]
set_max_transition 0.08 [get_ports {o_quotient_out[0]}]
set_max_transition 0.08 [get_ports o_complete]
set_max_transition 0.08 [get_ports o_overflow]
group_path -name FEEDTHROUGH  -from [list [get_ports {i_dividend[15]}] [get_ports {i_dividend[14]}] [get_ports {i_dividend[13]}] [get_ports {i_dividend[12]}] [get_ports {i_dividend[11]}] [get_ports {i_dividend[10]}] [get_ports {i_dividend[9]}] [get_ports {i_dividend[8]}] [get_ports {i_dividend[7]}] [get_ports {i_dividend[6]}] [get_ports {i_dividend[5]}] [get_ports {i_dividend[4]}] [get_ports {i_dividend[3]}] [get_ports {i_dividend[2]}] [get_ports {i_dividend[1]}] [get_ports {i_dividend[0]}] [get_ports {i_divisor[15]}] [get_ports {i_divisor[14]}] [get_ports {i_divisor[13]}] [get_ports {i_divisor[12]}] [get_ports {i_divisor[11]}] [get_ports {i_divisor[10]}] [get_ports {i_divisor[9]}] [get_ports {i_divisor[8]}] [get_ports {i_divisor[7]}] [get_ports {i_divisor[6]}] [get_ports {i_divisor[5]}] [get_ports {i_divisor[4]}] [get_ports {i_divisor[3]}] [get_ports {i_divisor[2]}] [get_ports {i_divisor[1]}] [get_ports {i_divisor[0]}] [get_ports i_start] [get_ports i_clk] [get_ports i_reset_n] [get_ports i_enable]]  -to [list [get_ports {o_quotient_out[15]}] [get_ports {o_quotient_out[14]}] [get_ports {o_quotient_out[13]}] [get_ports {o_quotient_out[12]}] [get_ports {o_quotient_out[11]}] [get_ports {o_quotient_out[10]}] [get_ports {o_quotient_out[9]}] [get_ports {o_quotient_out[8]}] [get_ports {o_quotient_out[7]}] [get_ports {o_quotient_out[6]}] [get_ports {o_quotient_out[5]}] [get_ports {o_quotient_out[4]}] [get_ports {o_quotient_out[3]}] [get_ports {o_quotient_out[2]}] [get_ports {o_quotient_out[1]}] [get_ports {o_quotient_out[0]}] [get_ports o_complete] [get_ports o_overflow]]
group_path -name REGIN  -from [list [get_ports {i_dividend[15]}] [get_ports {i_dividend[14]}] [get_ports {i_dividend[13]}] [get_ports {i_dividend[12]}] [get_ports {i_dividend[11]}] [get_ports {i_dividend[10]}] [get_ports {i_dividend[9]}] [get_ports {i_dividend[8]}] [get_ports {i_dividend[7]}] [get_ports {i_dividend[6]}] [get_ports {i_dividend[5]}] [get_ports {i_dividend[4]}] [get_ports {i_dividend[3]}] [get_ports {i_dividend[2]}] [get_ports {i_dividend[1]}] [get_ports {i_dividend[0]}] [get_ports {i_divisor[15]}] [get_ports {i_divisor[14]}] [get_ports {i_divisor[13]}] [get_ports {i_divisor[12]}] [get_ports {i_divisor[11]}] [get_ports {i_divisor[10]}] [get_ports {i_divisor[9]}] [get_ports {i_divisor[8]}] [get_ports {i_divisor[7]}] [get_ports {i_divisor[6]}] [get_ports {i_divisor[5]}] [get_ports {i_divisor[4]}] [get_ports {i_divisor[3]}] [get_ports {i_divisor[2]}] [get_ports {i_divisor[1]}] [get_ports {i_divisor[0]}] [get_ports i_start] [get_ports i_clk] [get_ports i_reset_n] [get_ports i_enable]]
group_path -name REGOUT  -to [list [get_ports {o_quotient_out[15]}] [get_ports {o_quotient_out[14]}] [get_ports {o_quotient_out[13]}] [get_ports {o_quotient_out[12]}] [get_ports {o_quotient_out[11]}] [get_ports {o_quotient_out[10]}] [get_ports {o_quotient_out[9]}] [get_ports {o_quotient_out[8]}] [get_ports {o_quotient_out[7]}] [get_ports {o_quotient_out[6]}] [get_ports {o_quotient_out[5]}] [get_ports {o_quotient_out[4]}] [get_ports {o_quotient_out[3]}] [get_ports {o_quotient_out[2]}] [get_ports {o_quotient_out[1]}] [get_ports {o_quotient_out[0]}] [get_ports o_complete] [get_ports o_overflow]]
