###################################################################

# Created by write_sdc on Thu Dec 5 11:20:59 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.15 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {x[0]}]
set_load -pin_load 0.3 [get_ports {y[15]}]
set_load -pin_load 0.3 [get_ports {y[14]}]
set_load -pin_load 0.3 [get_ports {y[13]}]
set_load -pin_load 0.3 [get_ports {y[12]}]
set_load -pin_load 0.3 [get_ports {y[11]}]
set_load -pin_load 0.3 [get_ports {y[10]}]
set_load -pin_load 0.3 [get_ports {y[9]}]
set_load -pin_load 0.3 [get_ports {y[8]}]
set_load -pin_load 0.3 [get_ports {y[7]}]
set_load -pin_load 0.3 [get_ports {y[6]}]
set_load -pin_load 0.3 [get_ports {y[5]}]
set_load -pin_load 0.3 [get_ports {y[4]}]
set_load -pin_load 0.3 [get_ports {y[3]}]
set_load -pin_load 0.3 [get_ports {y[2]}]
set_load -pin_load 0.3 [get_ports {y[1]}]
set_load -pin_load 0.3 [get_ports {y[0]}]
set_max_transition 0.08 [get_ports {y[15]}]
set_max_transition 0.08 [get_ports {y[14]}]
set_max_transition 0.08 [get_ports {y[13]}]
set_max_transition 0.08 [get_ports {y[12]}]
set_max_transition 0.08 [get_ports {y[11]}]
set_max_transition 0.08 [get_ports {y[10]}]
set_max_transition 0.08 [get_ports {y[9]}]
set_max_transition 0.08 [get_ports {y[8]}]
set_max_transition 0.08 [get_ports {y[7]}]
set_max_transition 0.08 [get_ports {y[6]}]
set_max_transition 0.08 [get_ports {y[5]}]
set_max_transition 0.08 [get_ports {y[4]}]
set_max_transition 0.08 [get_ports {y[3]}]
set_max_transition 0.08 [get_ports {y[2]}]
set_max_transition 0.08 [get_ports {y[1]}]
set_max_transition 0.08 [get_ports {y[0]}]
group_path -name FEEDTHROUGH  -from [list [get_ports {x[15]}] [get_ports {x[14]}] [get_ports {x[13]}] [get_ports {x[12]}] [get_ports {x[11]}] [get_ports {x[10]}] [get_ports {x[9]}] [get_ports {x[8]}] [get_ports {x[7]}] [get_ports {x[6]}] [get_ports {x[5]}] [get_ports {x[4]}] [get_ports {x[3]}] [get_ports {x[2]}] [get_ports {x[1]}] [get_ports {x[0]}]]  -to [list [get_ports {y[15]}] [get_ports {y[14]}] [get_ports {y[13]}] [get_ports {y[12]}] [get_ports {y[11]}] [get_ports {y[10]}] [get_ports {y[9]}] [get_ports {y[8]}] [get_ports {y[7]}] [get_ports {y[6]}] [get_ports {y[5]}] [get_ports {y[4]}] [get_ports {y[3]}] [get_ports {y[2]}] [get_ports {y[1]}] [get_ports {y[0]}]]
group_path -name REGIN  -from [list [get_ports {x[15]}] [get_ports {x[14]}] [get_ports {x[13]}] [get_ports {x[12]}] [get_ports {x[11]}] [get_ports {x[10]}] [get_ports {x[9]}] [get_ports {x[8]}] [get_ports {x[7]}] [get_ports {x[6]}] [get_ports {x[5]}] [get_ports {x[4]}] [get_ports {x[3]}] [get_ports {x[2]}] [get_ports {x[1]}] [get_ports {x[0]}]]
group_path -name REGOUT  -to [list [get_ports {y[15]}] [get_ports {y[14]}] [get_ports {y[13]}] [get_ports {y[12]}] [get_ports {y[11]}] [get_ports {y[10]}] [get_ports {y[9]}] [get_ports {y[8]}] [get_ports {y[7]}] [get_ports {y[6]}] [get_ports {y[5]}] [get_ports {y[4]}] [get_ports {y[3]}] [get_ports {y[2]}] [get_ports {y[1]}] [get_ports {y[0]}]]
