###################################################################

# Created by write_sdc on Fri Dec 6 20:51:03 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.15 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports clock]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports rst]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[63]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[62]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[61]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[60]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[59]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[58]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[57]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[56]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[55]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[54]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[53]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[52]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[51]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[50]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[49]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[48]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[47]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[46]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[45]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[44]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[43]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[42]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[41]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[40]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[39]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[38]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[37]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[36]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[35]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[34]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[33]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[32]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[31]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[30]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[29]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[28]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[27]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[26]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[25]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[24]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[23]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[22]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[21]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[20]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[19]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[18]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[17]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[16]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {X_in[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {W_in[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {W_in[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {W_in[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {W_in[0]}]
set_load -pin_load 0.3 [get_ports {Y_out[255]}]
set_load -pin_load 0.3 [get_ports {Y_out[254]}]
set_load -pin_load 0.3 [get_ports {Y_out[253]}]
set_load -pin_load 0.3 [get_ports {Y_out[252]}]
set_load -pin_load 0.3 [get_ports {Y_out[251]}]
set_load -pin_load 0.3 [get_ports {Y_out[250]}]
set_load -pin_load 0.3 [get_ports {Y_out[249]}]
set_load -pin_load 0.3 [get_ports {Y_out[248]}]
set_load -pin_load 0.3 [get_ports {Y_out[247]}]
set_load -pin_load 0.3 [get_ports {Y_out[246]}]
set_load -pin_load 0.3 [get_ports {Y_out[245]}]
set_load -pin_load 0.3 [get_ports {Y_out[244]}]
set_load -pin_load 0.3 [get_ports {Y_out[243]}]
set_load -pin_load 0.3 [get_ports {Y_out[242]}]
set_load -pin_load 0.3 [get_ports {Y_out[241]}]
set_load -pin_load 0.3 [get_ports {Y_out[240]}]
set_load -pin_load 0.3 [get_ports {Y_out[239]}]
set_load -pin_load 0.3 [get_ports {Y_out[238]}]
set_load -pin_load 0.3 [get_ports {Y_out[237]}]
set_load -pin_load 0.3 [get_ports {Y_out[236]}]
set_load -pin_load 0.3 [get_ports {Y_out[235]}]
set_load -pin_load 0.3 [get_ports {Y_out[234]}]
set_load -pin_load 0.3 [get_ports {Y_out[233]}]
set_load -pin_load 0.3 [get_ports {Y_out[232]}]
set_load -pin_load 0.3 [get_ports {Y_out[231]}]
set_load -pin_load 0.3 [get_ports {Y_out[230]}]
set_load -pin_load 0.3 [get_ports {Y_out[229]}]
set_load -pin_load 0.3 [get_ports {Y_out[228]}]
set_load -pin_load 0.3 [get_ports {Y_out[227]}]
set_load -pin_load 0.3 [get_ports {Y_out[226]}]
set_load -pin_load 0.3 [get_ports {Y_out[225]}]
set_load -pin_load 0.3 [get_ports {Y_out[224]}]
set_load -pin_load 0.3 [get_ports {Y_out[223]}]
set_load -pin_load 0.3 [get_ports {Y_out[222]}]
set_load -pin_load 0.3 [get_ports {Y_out[221]}]
set_load -pin_load 0.3 [get_ports {Y_out[220]}]
set_load -pin_load 0.3 [get_ports {Y_out[219]}]
set_load -pin_load 0.3 [get_ports {Y_out[218]}]
set_load -pin_load 0.3 [get_ports {Y_out[217]}]
set_load -pin_load 0.3 [get_ports {Y_out[216]}]
set_load -pin_load 0.3 [get_ports {Y_out[215]}]
set_load -pin_load 0.3 [get_ports {Y_out[214]}]
set_load -pin_load 0.3 [get_ports {Y_out[213]}]
set_load -pin_load 0.3 [get_ports {Y_out[212]}]
set_load -pin_load 0.3 [get_ports {Y_out[211]}]
set_load -pin_load 0.3 [get_ports {Y_out[210]}]
set_load -pin_load 0.3 [get_ports {Y_out[209]}]
set_load -pin_load 0.3 [get_ports {Y_out[208]}]
set_load -pin_load 0.3 [get_ports {Y_out[207]}]
set_load -pin_load 0.3 [get_ports {Y_out[206]}]
set_load -pin_load 0.3 [get_ports {Y_out[205]}]
set_load -pin_load 0.3 [get_ports {Y_out[204]}]
set_load -pin_load 0.3 [get_ports {Y_out[203]}]
set_load -pin_load 0.3 [get_ports {Y_out[202]}]
set_load -pin_load 0.3 [get_ports {Y_out[201]}]
set_load -pin_load 0.3 [get_ports {Y_out[200]}]
set_load -pin_load 0.3 [get_ports {Y_out[199]}]
set_load -pin_load 0.3 [get_ports {Y_out[198]}]
set_load -pin_load 0.3 [get_ports {Y_out[197]}]
set_load -pin_load 0.3 [get_ports {Y_out[196]}]
set_load -pin_load 0.3 [get_ports {Y_out[195]}]
set_load -pin_load 0.3 [get_ports {Y_out[194]}]
set_load -pin_load 0.3 [get_ports {Y_out[193]}]
set_load -pin_load 0.3 [get_ports {Y_out[192]}]
set_load -pin_load 0.3 [get_ports {Y_out[191]}]
set_load -pin_load 0.3 [get_ports {Y_out[190]}]
set_load -pin_load 0.3 [get_ports {Y_out[189]}]
set_load -pin_load 0.3 [get_ports {Y_out[188]}]
set_load -pin_load 0.3 [get_ports {Y_out[187]}]
set_load -pin_load 0.3 [get_ports {Y_out[186]}]
set_load -pin_load 0.3 [get_ports {Y_out[185]}]
set_load -pin_load 0.3 [get_ports {Y_out[184]}]
set_load -pin_load 0.3 [get_ports {Y_out[183]}]
set_load -pin_load 0.3 [get_ports {Y_out[182]}]
set_load -pin_load 0.3 [get_ports {Y_out[181]}]
set_load -pin_load 0.3 [get_ports {Y_out[180]}]
set_load -pin_load 0.3 [get_ports {Y_out[179]}]
set_load -pin_load 0.3 [get_ports {Y_out[178]}]
set_load -pin_load 0.3 [get_ports {Y_out[177]}]
set_load -pin_load 0.3 [get_ports {Y_out[176]}]
set_load -pin_load 0.3 [get_ports {Y_out[175]}]
set_load -pin_load 0.3 [get_ports {Y_out[174]}]
set_load -pin_load 0.3 [get_ports {Y_out[173]}]
set_load -pin_load 0.3 [get_ports {Y_out[172]}]
set_load -pin_load 0.3 [get_ports {Y_out[171]}]
set_load -pin_load 0.3 [get_ports {Y_out[170]}]
set_load -pin_load 0.3 [get_ports {Y_out[169]}]
set_load -pin_load 0.3 [get_ports {Y_out[168]}]
set_load -pin_load 0.3 [get_ports {Y_out[167]}]
set_load -pin_load 0.3 [get_ports {Y_out[166]}]
set_load -pin_load 0.3 [get_ports {Y_out[165]}]
set_load -pin_load 0.3 [get_ports {Y_out[164]}]
set_load -pin_load 0.3 [get_ports {Y_out[163]}]
set_load -pin_load 0.3 [get_ports {Y_out[162]}]
set_load -pin_load 0.3 [get_ports {Y_out[161]}]
set_load -pin_load 0.3 [get_ports {Y_out[160]}]
set_load -pin_load 0.3 [get_ports {Y_out[159]}]
set_load -pin_load 0.3 [get_ports {Y_out[158]}]
set_load -pin_load 0.3 [get_ports {Y_out[157]}]
set_load -pin_load 0.3 [get_ports {Y_out[156]}]
set_load -pin_load 0.3 [get_ports {Y_out[155]}]
set_load -pin_load 0.3 [get_ports {Y_out[154]}]
set_load -pin_load 0.3 [get_ports {Y_out[153]}]
set_load -pin_load 0.3 [get_ports {Y_out[152]}]
set_load -pin_load 0.3 [get_ports {Y_out[151]}]
set_load -pin_load 0.3 [get_ports {Y_out[150]}]
set_load -pin_load 0.3 [get_ports {Y_out[149]}]
set_load -pin_load 0.3 [get_ports {Y_out[148]}]
set_load -pin_load 0.3 [get_ports {Y_out[147]}]
set_load -pin_load 0.3 [get_ports {Y_out[146]}]
set_load -pin_load 0.3 [get_ports {Y_out[145]}]
set_load -pin_load 0.3 [get_ports {Y_out[144]}]
set_load -pin_load 0.3 [get_ports {Y_out[143]}]
set_load -pin_load 0.3 [get_ports {Y_out[142]}]
set_load -pin_load 0.3 [get_ports {Y_out[141]}]
set_load -pin_load 0.3 [get_ports {Y_out[140]}]
set_load -pin_load 0.3 [get_ports {Y_out[139]}]
set_load -pin_load 0.3 [get_ports {Y_out[138]}]
set_load -pin_load 0.3 [get_ports {Y_out[137]}]
set_load -pin_load 0.3 [get_ports {Y_out[136]}]
set_load -pin_load 0.3 [get_ports {Y_out[135]}]
set_load -pin_load 0.3 [get_ports {Y_out[134]}]
set_load -pin_load 0.3 [get_ports {Y_out[133]}]
set_load -pin_load 0.3 [get_ports {Y_out[132]}]
set_load -pin_load 0.3 [get_ports {Y_out[131]}]
set_load -pin_load 0.3 [get_ports {Y_out[130]}]
set_load -pin_load 0.3 [get_ports {Y_out[129]}]
set_load -pin_load 0.3 [get_ports {Y_out[128]}]
set_load -pin_load 0.3 [get_ports {Y_out[127]}]
set_load -pin_load 0.3 [get_ports {Y_out[126]}]
set_load -pin_load 0.3 [get_ports {Y_out[125]}]
set_load -pin_load 0.3 [get_ports {Y_out[124]}]
set_load -pin_load 0.3 [get_ports {Y_out[123]}]
set_load -pin_load 0.3 [get_ports {Y_out[122]}]
set_load -pin_load 0.3 [get_ports {Y_out[121]}]
set_load -pin_load 0.3 [get_ports {Y_out[120]}]
set_load -pin_load 0.3 [get_ports {Y_out[119]}]
set_load -pin_load 0.3 [get_ports {Y_out[118]}]
set_load -pin_load 0.3 [get_ports {Y_out[117]}]
set_load -pin_load 0.3 [get_ports {Y_out[116]}]
set_load -pin_load 0.3 [get_ports {Y_out[115]}]
set_load -pin_load 0.3 [get_ports {Y_out[114]}]
set_load -pin_load 0.3 [get_ports {Y_out[113]}]
set_load -pin_load 0.3 [get_ports {Y_out[112]}]
set_load -pin_load 0.3 [get_ports {Y_out[111]}]
set_load -pin_load 0.3 [get_ports {Y_out[110]}]
set_load -pin_load 0.3 [get_ports {Y_out[109]}]
set_load -pin_load 0.3 [get_ports {Y_out[108]}]
set_load -pin_load 0.3 [get_ports {Y_out[107]}]
set_load -pin_load 0.3 [get_ports {Y_out[106]}]
set_load -pin_load 0.3 [get_ports {Y_out[105]}]
set_load -pin_load 0.3 [get_ports {Y_out[104]}]
set_load -pin_load 0.3 [get_ports {Y_out[103]}]
set_load -pin_load 0.3 [get_ports {Y_out[102]}]
set_load -pin_load 0.3 [get_ports {Y_out[101]}]
set_load -pin_load 0.3 [get_ports {Y_out[100]}]
set_load -pin_load 0.3 [get_ports {Y_out[99]}]
set_load -pin_load 0.3 [get_ports {Y_out[98]}]
set_load -pin_load 0.3 [get_ports {Y_out[97]}]
set_load -pin_load 0.3 [get_ports {Y_out[96]}]
set_load -pin_load 0.3 [get_ports {Y_out[95]}]
set_load -pin_load 0.3 [get_ports {Y_out[94]}]
set_load -pin_load 0.3 [get_ports {Y_out[93]}]
set_load -pin_load 0.3 [get_ports {Y_out[92]}]
set_load -pin_load 0.3 [get_ports {Y_out[91]}]
set_load -pin_load 0.3 [get_ports {Y_out[90]}]
set_load -pin_load 0.3 [get_ports {Y_out[89]}]
set_load -pin_load 0.3 [get_ports {Y_out[88]}]
set_load -pin_load 0.3 [get_ports {Y_out[87]}]
set_load -pin_load 0.3 [get_ports {Y_out[86]}]
set_load -pin_load 0.3 [get_ports {Y_out[85]}]
set_load -pin_load 0.3 [get_ports {Y_out[84]}]
set_load -pin_load 0.3 [get_ports {Y_out[83]}]
set_load -pin_load 0.3 [get_ports {Y_out[82]}]
set_load -pin_load 0.3 [get_ports {Y_out[81]}]
set_load -pin_load 0.3 [get_ports {Y_out[80]}]
set_load -pin_load 0.3 [get_ports {Y_out[79]}]
set_load -pin_load 0.3 [get_ports {Y_out[78]}]
set_load -pin_load 0.3 [get_ports {Y_out[77]}]
set_load -pin_load 0.3 [get_ports {Y_out[76]}]
set_load -pin_load 0.3 [get_ports {Y_out[75]}]
set_load -pin_load 0.3 [get_ports {Y_out[74]}]
set_load -pin_load 0.3 [get_ports {Y_out[73]}]
set_load -pin_load 0.3 [get_ports {Y_out[72]}]
set_load -pin_load 0.3 [get_ports {Y_out[71]}]
set_load -pin_load 0.3 [get_ports {Y_out[70]}]
set_load -pin_load 0.3 [get_ports {Y_out[69]}]
set_load -pin_load 0.3 [get_ports {Y_out[68]}]
set_load -pin_load 0.3 [get_ports {Y_out[67]}]
set_load -pin_load 0.3 [get_ports {Y_out[66]}]
set_load -pin_load 0.3 [get_ports {Y_out[65]}]
set_load -pin_load 0.3 [get_ports {Y_out[64]}]
set_load -pin_load 0.3 [get_ports {Y_out[63]}]
set_load -pin_load 0.3 [get_ports {Y_out[62]}]
set_load -pin_load 0.3 [get_ports {Y_out[61]}]
set_load -pin_load 0.3 [get_ports {Y_out[60]}]
set_load -pin_load 0.3 [get_ports {Y_out[59]}]
set_load -pin_load 0.3 [get_ports {Y_out[58]}]
set_load -pin_load 0.3 [get_ports {Y_out[57]}]
set_load -pin_load 0.3 [get_ports {Y_out[56]}]
set_load -pin_load 0.3 [get_ports {Y_out[55]}]
set_load -pin_load 0.3 [get_ports {Y_out[54]}]
set_load -pin_load 0.3 [get_ports {Y_out[53]}]
set_load -pin_load 0.3 [get_ports {Y_out[52]}]
set_load -pin_load 0.3 [get_ports {Y_out[51]}]
set_load -pin_load 0.3 [get_ports {Y_out[50]}]
set_load -pin_load 0.3 [get_ports {Y_out[49]}]
set_load -pin_load 0.3 [get_ports {Y_out[48]}]
set_load -pin_load 0.3 [get_ports {Y_out[47]}]
set_load -pin_load 0.3 [get_ports {Y_out[46]}]
set_load -pin_load 0.3 [get_ports {Y_out[45]}]
set_load -pin_load 0.3 [get_ports {Y_out[44]}]
set_load -pin_load 0.3 [get_ports {Y_out[43]}]
set_load -pin_load 0.3 [get_ports {Y_out[42]}]
set_load -pin_load 0.3 [get_ports {Y_out[41]}]
set_load -pin_load 0.3 [get_ports {Y_out[40]}]
set_load -pin_load 0.3 [get_ports {Y_out[39]}]
set_load -pin_load 0.3 [get_ports {Y_out[38]}]
set_load -pin_load 0.3 [get_ports {Y_out[37]}]
set_load -pin_load 0.3 [get_ports {Y_out[36]}]
set_load -pin_load 0.3 [get_ports {Y_out[35]}]
set_load -pin_load 0.3 [get_ports {Y_out[34]}]
set_load -pin_load 0.3 [get_ports {Y_out[33]}]
set_load -pin_load 0.3 [get_ports {Y_out[32]}]
set_load -pin_load 0.3 [get_ports {Y_out[31]}]
set_load -pin_load 0.3 [get_ports {Y_out[30]}]
set_load -pin_load 0.3 [get_ports {Y_out[29]}]
set_load -pin_load 0.3 [get_ports {Y_out[28]}]
set_load -pin_load 0.3 [get_ports {Y_out[27]}]
set_load -pin_load 0.3 [get_ports {Y_out[26]}]
set_load -pin_load 0.3 [get_ports {Y_out[25]}]
set_load -pin_load 0.3 [get_ports {Y_out[24]}]
set_load -pin_load 0.3 [get_ports {Y_out[23]}]
set_load -pin_load 0.3 [get_ports {Y_out[22]}]
set_load -pin_load 0.3 [get_ports {Y_out[21]}]
set_load -pin_load 0.3 [get_ports {Y_out[20]}]
set_load -pin_load 0.3 [get_ports {Y_out[19]}]
set_load -pin_load 0.3 [get_ports {Y_out[18]}]
set_load -pin_load 0.3 [get_ports {Y_out[17]}]
set_load -pin_load 0.3 [get_ports {Y_out[16]}]
set_load -pin_load 0.3 [get_ports {Y_out[15]}]
set_load -pin_load 0.3 [get_ports {Y_out[14]}]
set_load -pin_load 0.3 [get_ports {Y_out[13]}]
set_load -pin_load 0.3 [get_ports {Y_out[12]}]
set_load -pin_load 0.3 [get_ports {Y_out[11]}]
set_load -pin_load 0.3 [get_ports {Y_out[10]}]
set_load -pin_load 0.3 [get_ports {Y_out[9]}]
set_load -pin_load 0.3 [get_ports {Y_out[8]}]
set_load -pin_load 0.3 [get_ports {Y_out[7]}]
set_load -pin_load 0.3 [get_ports {Y_out[6]}]
set_load -pin_load 0.3 [get_ports {Y_out[5]}]
set_load -pin_load 0.3 [get_ports {Y_out[4]}]
set_load -pin_load 0.3 [get_ports {Y_out[3]}]
set_load -pin_load 0.3 [get_ports {Y_out[2]}]
set_load -pin_load 0.3 [get_ports {Y_out[1]}]
set_load -pin_load 0.3 [get_ports {Y_out[0]}]
set_max_transition 0.08 [get_ports {Y_out[255]}]
set_max_transition 0.08 [get_ports {Y_out[254]}]
set_max_transition 0.08 [get_ports {Y_out[253]}]
set_max_transition 0.08 [get_ports {Y_out[252]}]
set_max_transition 0.08 [get_ports {Y_out[251]}]
set_max_transition 0.08 [get_ports {Y_out[250]}]
set_max_transition 0.08 [get_ports {Y_out[249]}]
set_max_transition 0.08 [get_ports {Y_out[248]}]
set_max_transition 0.08 [get_ports {Y_out[247]}]
set_max_transition 0.08 [get_ports {Y_out[246]}]
set_max_transition 0.08 [get_ports {Y_out[245]}]
set_max_transition 0.08 [get_ports {Y_out[244]}]
set_max_transition 0.08 [get_ports {Y_out[243]}]
set_max_transition 0.08 [get_ports {Y_out[242]}]
set_max_transition 0.08 [get_ports {Y_out[241]}]
set_max_transition 0.08 [get_ports {Y_out[240]}]
set_max_transition 0.08 [get_ports {Y_out[239]}]
set_max_transition 0.08 [get_ports {Y_out[238]}]
set_max_transition 0.08 [get_ports {Y_out[237]}]
set_max_transition 0.08 [get_ports {Y_out[236]}]
set_max_transition 0.08 [get_ports {Y_out[235]}]
set_max_transition 0.08 [get_ports {Y_out[234]}]
set_max_transition 0.08 [get_ports {Y_out[233]}]
set_max_transition 0.08 [get_ports {Y_out[232]}]
set_max_transition 0.08 [get_ports {Y_out[231]}]
set_max_transition 0.08 [get_ports {Y_out[230]}]
set_max_transition 0.08 [get_ports {Y_out[229]}]
set_max_transition 0.08 [get_ports {Y_out[228]}]
set_max_transition 0.08 [get_ports {Y_out[227]}]
set_max_transition 0.08 [get_ports {Y_out[226]}]
set_max_transition 0.08 [get_ports {Y_out[225]}]
set_max_transition 0.08 [get_ports {Y_out[224]}]
set_max_transition 0.08 [get_ports {Y_out[223]}]
set_max_transition 0.08 [get_ports {Y_out[222]}]
set_max_transition 0.08 [get_ports {Y_out[221]}]
set_max_transition 0.08 [get_ports {Y_out[220]}]
set_max_transition 0.08 [get_ports {Y_out[219]}]
set_max_transition 0.08 [get_ports {Y_out[218]}]
set_max_transition 0.08 [get_ports {Y_out[217]}]
set_max_transition 0.08 [get_ports {Y_out[216]}]
set_max_transition 0.08 [get_ports {Y_out[215]}]
set_max_transition 0.08 [get_ports {Y_out[214]}]
set_max_transition 0.08 [get_ports {Y_out[213]}]
set_max_transition 0.08 [get_ports {Y_out[212]}]
set_max_transition 0.08 [get_ports {Y_out[211]}]
set_max_transition 0.08 [get_ports {Y_out[210]}]
set_max_transition 0.08 [get_ports {Y_out[209]}]
set_max_transition 0.08 [get_ports {Y_out[208]}]
set_max_transition 0.08 [get_ports {Y_out[207]}]
set_max_transition 0.08 [get_ports {Y_out[206]}]
set_max_transition 0.08 [get_ports {Y_out[205]}]
set_max_transition 0.08 [get_ports {Y_out[204]}]
set_max_transition 0.08 [get_ports {Y_out[203]}]
set_max_transition 0.08 [get_ports {Y_out[202]}]
set_max_transition 0.08 [get_ports {Y_out[201]}]
set_max_transition 0.08 [get_ports {Y_out[200]}]
set_max_transition 0.08 [get_ports {Y_out[199]}]
set_max_transition 0.08 [get_ports {Y_out[198]}]
set_max_transition 0.08 [get_ports {Y_out[197]}]
set_max_transition 0.08 [get_ports {Y_out[196]}]
set_max_transition 0.08 [get_ports {Y_out[195]}]
set_max_transition 0.08 [get_ports {Y_out[194]}]
set_max_transition 0.08 [get_ports {Y_out[193]}]
set_max_transition 0.08 [get_ports {Y_out[192]}]
set_max_transition 0.08 [get_ports {Y_out[191]}]
set_max_transition 0.08 [get_ports {Y_out[190]}]
set_max_transition 0.08 [get_ports {Y_out[189]}]
set_max_transition 0.08 [get_ports {Y_out[188]}]
set_max_transition 0.08 [get_ports {Y_out[187]}]
set_max_transition 0.08 [get_ports {Y_out[186]}]
set_max_transition 0.08 [get_ports {Y_out[185]}]
set_max_transition 0.08 [get_ports {Y_out[184]}]
set_max_transition 0.08 [get_ports {Y_out[183]}]
set_max_transition 0.08 [get_ports {Y_out[182]}]
set_max_transition 0.08 [get_ports {Y_out[181]}]
set_max_transition 0.08 [get_ports {Y_out[180]}]
set_max_transition 0.08 [get_ports {Y_out[179]}]
set_max_transition 0.08 [get_ports {Y_out[178]}]
set_max_transition 0.08 [get_ports {Y_out[177]}]
set_max_transition 0.08 [get_ports {Y_out[176]}]
set_max_transition 0.08 [get_ports {Y_out[175]}]
set_max_transition 0.08 [get_ports {Y_out[174]}]
set_max_transition 0.08 [get_ports {Y_out[173]}]
set_max_transition 0.08 [get_ports {Y_out[172]}]
set_max_transition 0.08 [get_ports {Y_out[171]}]
set_max_transition 0.08 [get_ports {Y_out[170]}]
set_max_transition 0.08 [get_ports {Y_out[169]}]
set_max_transition 0.08 [get_ports {Y_out[168]}]
set_max_transition 0.08 [get_ports {Y_out[167]}]
set_max_transition 0.08 [get_ports {Y_out[166]}]
set_max_transition 0.08 [get_ports {Y_out[165]}]
set_max_transition 0.08 [get_ports {Y_out[164]}]
set_max_transition 0.08 [get_ports {Y_out[163]}]
set_max_transition 0.08 [get_ports {Y_out[162]}]
set_max_transition 0.08 [get_ports {Y_out[161]}]
set_max_transition 0.08 [get_ports {Y_out[160]}]
set_max_transition 0.08 [get_ports {Y_out[159]}]
set_max_transition 0.08 [get_ports {Y_out[158]}]
set_max_transition 0.08 [get_ports {Y_out[157]}]
set_max_transition 0.08 [get_ports {Y_out[156]}]
set_max_transition 0.08 [get_ports {Y_out[155]}]
set_max_transition 0.08 [get_ports {Y_out[154]}]
set_max_transition 0.08 [get_ports {Y_out[153]}]
set_max_transition 0.08 [get_ports {Y_out[152]}]
set_max_transition 0.08 [get_ports {Y_out[151]}]
set_max_transition 0.08 [get_ports {Y_out[150]}]
set_max_transition 0.08 [get_ports {Y_out[149]}]
set_max_transition 0.08 [get_ports {Y_out[148]}]
set_max_transition 0.08 [get_ports {Y_out[147]}]
set_max_transition 0.08 [get_ports {Y_out[146]}]
set_max_transition 0.08 [get_ports {Y_out[145]}]
set_max_transition 0.08 [get_ports {Y_out[144]}]
set_max_transition 0.08 [get_ports {Y_out[143]}]
set_max_transition 0.08 [get_ports {Y_out[142]}]
set_max_transition 0.08 [get_ports {Y_out[141]}]
set_max_transition 0.08 [get_ports {Y_out[140]}]
set_max_transition 0.08 [get_ports {Y_out[139]}]
set_max_transition 0.08 [get_ports {Y_out[138]}]
set_max_transition 0.08 [get_ports {Y_out[137]}]
set_max_transition 0.08 [get_ports {Y_out[136]}]
set_max_transition 0.08 [get_ports {Y_out[135]}]
set_max_transition 0.08 [get_ports {Y_out[134]}]
set_max_transition 0.08 [get_ports {Y_out[133]}]
set_max_transition 0.08 [get_ports {Y_out[132]}]
set_max_transition 0.08 [get_ports {Y_out[131]}]
set_max_transition 0.08 [get_ports {Y_out[130]}]
set_max_transition 0.08 [get_ports {Y_out[129]}]
set_max_transition 0.08 [get_ports {Y_out[128]}]
set_max_transition 0.08 [get_ports {Y_out[127]}]
set_max_transition 0.08 [get_ports {Y_out[126]}]
set_max_transition 0.08 [get_ports {Y_out[125]}]
set_max_transition 0.08 [get_ports {Y_out[124]}]
set_max_transition 0.08 [get_ports {Y_out[123]}]
set_max_transition 0.08 [get_ports {Y_out[122]}]
set_max_transition 0.08 [get_ports {Y_out[121]}]
set_max_transition 0.08 [get_ports {Y_out[120]}]
set_max_transition 0.08 [get_ports {Y_out[119]}]
set_max_transition 0.08 [get_ports {Y_out[118]}]
set_max_transition 0.08 [get_ports {Y_out[117]}]
set_max_transition 0.08 [get_ports {Y_out[116]}]
set_max_transition 0.08 [get_ports {Y_out[115]}]
set_max_transition 0.08 [get_ports {Y_out[114]}]
set_max_transition 0.08 [get_ports {Y_out[113]}]
set_max_transition 0.08 [get_ports {Y_out[112]}]
set_max_transition 0.08 [get_ports {Y_out[111]}]
set_max_transition 0.08 [get_ports {Y_out[110]}]
set_max_transition 0.08 [get_ports {Y_out[109]}]
set_max_transition 0.08 [get_ports {Y_out[108]}]
set_max_transition 0.08 [get_ports {Y_out[107]}]
set_max_transition 0.08 [get_ports {Y_out[106]}]
set_max_transition 0.08 [get_ports {Y_out[105]}]
set_max_transition 0.08 [get_ports {Y_out[104]}]
set_max_transition 0.08 [get_ports {Y_out[103]}]
set_max_transition 0.08 [get_ports {Y_out[102]}]
set_max_transition 0.08 [get_ports {Y_out[101]}]
set_max_transition 0.08 [get_ports {Y_out[100]}]
set_max_transition 0.08 [get_ports {Y_out[99]}]
set_max_transition 0.08 [get_ports {Y_out[98]}]
set_max_transition 0.08 [get_ports {Y_out[97]}]
set_max_transition 0.08 [get_ports {Y_out[96]}]
set_max_transition 0.08 [get_ports {Y_out[95]}]
set_max_transition 0.08 [get_ports {Y_out[94]}]
set_max_transition 0.08 [get_ports {Y_out[93]}]
set_max_transition 0.08 [get_ports {Y_out[92]}]
set_max_transition 0.08 [get_ports {Y_out[91]}]
set_max_transition 0.08 [get_ports {Y_out[90]}]
set_max_transition 0.08 [get_ports {Y_out[89]}]
set_max_transition 0.08 [get_ports {Y_out[88]}]
set_max_transition 0.08 [get_ports {Y_out[87]}]
set_max_transition 0.08 [get_ports {Y_out[86]}]
set_max_transition 0.08 [get_ports {Y_out[85]}]
set_max_transition 0.08 [get_ports {Y_out[84]}]
set_max_transition 0.08 [get_ports {Y_out[83]}]
set_max_transition 0.08 [get_ports {Y_out[82]}]
set_max_transition 0.08 [get_ports {Y_out[81]}]
set_max_transition 0.08 [get_ports {Y_out[80]}]
set_max_transition 0.08 [get_ports {Y_out[79]}]
set_max_transition 0.08 [get_ports {Y_out[78]}]
set_max_transition 0.08 [get_ports {Y_out[77]}]
set_max_transition 0.08 [get_ports {Y_out[76]}]
set_max_transition 0.08 [get_ports {Y_out[75]}]
set_max_transition 0.08 [get_ports {Y_out[74]}]
set_max_transition 0.08 [get_ports {Y_out[73]}]
set_max_transition 0.08 [get_ports {Y_out[72]}]
set_max_transition 0.08 [get_ports {Y_out[71]}]
set_max_transition 0.08 [get_ports {Y_out[70]}]
set_max_transition 0.08 [get_ports {Y_out[69]}]
set_max_transition 0.08 [get_ports {Y_out[68]}]
set_max_transition 0.08 [get_ports {Y_out[67]}]
set_max_transition 0.08 [get_ports {Y_out[66]}]
set_max_transition 0.08 [get_ports {Y_out[65]}]
set_max_transition 0.08 [get_ports {Y_out[64]}]
set_max_transition 0.08 [get_ports {Y_out[63]}]
set_max_transition 0.08 [get_ports {Y_out[62]}]
set_max_transition 0.08 [get_ports {Y_out[61]}]
set_max_transition 0.08 [get_ports {Y_out[60]}]
set_max_transition 0.08 [get_ports {Y_out[59]}]
set_max_transition 0.08 [get_ports {Y_out[58]}]
set_max_transition 0.08 [get_ports {Y_out[57]}]
set_max_transition 0.08 [get_ports {Y_out[56]}]
set_max_transition 0.08 [get_ports {Y_out[55]}]
set_max_transition 0.08 [get_ports {Y_out[54]}]
set_max_transition 0.08 [get_ports {Y_out[53]}]
set_max_transition 0.08 [get_ports {Y_out[52]}]
set_max_transition 0.08 [get_ports {Y_out[51]}]
set_max_transition 0.08 [get_ports {Y_out[50]}]
set_max_transition 0.08 [get_ports {Y_out[49]}]
set_max_transition 0.08 [get_ports {Y_out[48]}]
set_max_transition 0.08 [get_ports {Y_out[47]}]
set_max_transition 0.08 [get_ports {Y_out[46]}]
set_max_transition 0.08 [get_ports {Y_out[45]}]
set_max_transition 0.08 [get_ports {Y_out[44]}]
set_max_transition 0.08 [get_ports {Y_out[43]}]
set_max_transition 0.08 [get_ports {Y_out[42]}]
set_max_transition 0.08 [get_ports {Y_out[41]}]
set_max_transition 0.08 [get_ports {Y_out[40]}]
set_max_transition 0.08 [get_ports {Y_out[39]}]
set_max_transition 0.08 [get_ports {Y_out[38]}]
set_max_transition 0.08 [get_ports {Y_out[37]}]
set_max_transition 0.08 [get_ports {Y_out[36]}]
set_max_transition 0.08 [get_ports {Y_out[35]}]
set_max_transition 0.08 [get_ports {Y_out[34]}]
set_max_transition 0.08 [get_ports {Y_out[33]}]
set_max_transition 0.08 [get_ports {Y_out[32]}]
set_max_transition 0.08 [get_ports {Y_out[31]}]
set_max_transition 0.08 [get_ports {Y_out[30]}]
set_max_transition 0.08 [get_ports {Y_out[29]}]
set_max_transition 0.08 [get_ports {Y_out[28]}]
set_max_transition 0.08 [get_ports {Y_out[27]}]
set_max_transition 0.08 [get_ports {Y_out[26]}]
set_max_transition 0.08 [get_ports {Y_out[25]}]
set_max_transition 0.08 [get_ports {Y_out[24]}]
set_max_transition 0.08 [get_ports {Y_out[23]}]
set_max_transition 0.08 [get_ports {Y_out[22]}]
set_max_transition 0.08 [get_ports {Y_out[21]}]
set_max_transition 0.08 [get_ports {Y_out[20]}]
set_max_transition 0.08 [get_ports {Y_out[19]}]
set_max_transition 0.08 [get_ports {Y_out[18]}]
set_max_transition 0.08 [get_ports {Y_out[17]}]
set_max_transition 0.08 [get_ports {Y_out[16]}]
set_max_transition 0.08 [get_ports {Y_out[15]}]
set_max_transition 0.08 [get_ports {Y_out[14]}]
set_max_transition 0.08 [get_ports {Y_out[13]}]
set_max_transition 0.08 [get_ports {Y_out[12]}]
set_max_transition 0.08 [get_ports {Y_out[11]}]
set_max_transition 0.08 [get_ports {Y_out[10]}]
set_max_transition 0.08 [get_ports {Y_out[9]}]
set_max_transition 0.08 [get_ports {Y_out[8]}]
set_max_transition 0.08 [get_ports {Y_out[7]}]
set_max_transition 0.08 [get_ports {Y_out[6]}]
set_max_transition 0.08 [get_ports {Y_out[5]}]
set_max_transition 0.08 [get_ports {Y_out[4]}]
set_max_transition 0.08 [get_ports {Y_out[3]}]
set_max_transition 0.08 [get_ports {Y_out[2]}]
set_max_transition 0.08 [get_ports {Y_out[1]}]
set_max_transition 0.08 [get_ports {Y_out[0]}]
create_clock [get_ports clock]  -name core_clk  -period 10  -waveform {0 5}
set_clock_latency 0.2  [get_clocks core_clk]
set_clock_uncertainty 1  [get_clocks core_clk]
set_clock_transition -max -rise 0.08 [get_clocks core_clk]
set_clock_transition -max -fall 0.08 [get_clocks core_clk]
set_clock_transition -min -rise 0.08 [get_clocks core_clk]
set_clock_transition -min -fall 0.08 [get_clocks core_clk]
group_path -name FEEDTHROUGH  -from [list [get_ports rst] [get_ports {X_in[63]}] [get_ports {X_in[62]}] [get_ports {X_in[61]}] [get_ports {X_in[60]}] [get_ports {X_in[59]}] [get_ports {X_in[58]}] [get_ports {X_in[57]}] [get_ports {X_in[56]}] [get_ports {X_in[55]}] [get_ports {X_in[54]}] [get_ports {X_in[53]}] [get_ports {X_in[52]}] [get_ports {X_in[51]}] [get_ports {X_in[50]}] [get_ports {X_in[49]}] [get_ports {X_in[48]}] [get_ports {X_in[47]}] [get_ports {X_in[46]}] [get_ports {X_in[45]}] [get_ports {X_in[44]}] [get_ports {X_in[43]}] [get_ports {X_in[42]}] [get_ports {X_in[41]}] [get_ports {X_in[40]}] [get_ports {X_in[39]}] [get_ports {X_in[38]}] [get_ports {X_in[37]}] [get_ports {X_in[36]}] [get_ports {X_in[35]}] [get_ports {X_in[34]}] [get_ports {X_in[33]}] [get_ports {X_in[32]}] [get_ports {X_in[31]}] [get_ports {X_in[30]}] [get_ports {X_in[29]}] [get_ports {X_in[28]}] [get_ports {X_in[27]}] [get_ports {X_in[26]}] [get_ports {X_in[25]}] [get_ports {X_in[24]}] [get_ports {X_in[23]}] [get_ports {X_in[22]}] [get_ports {X_in[21]}] [get_ports {X_in[20]}] [get_ports {X_in[19]}] [get_ports {X_in[18]}] [get_ports {X_in[17]}] [get_ports {X_in[16]}] [get_ports {X_in[15]}] [get_ports {X_in[14]}] [get_ports {X_in[13]}] [get_ports {X_in[12]}] [get_ports {X_in[11]}] [get_ports {X_in[10]}] [get_ports {X_in[9]}] [get_ports {X_in[8]}] [get_ports {X_in[7]}] [get_ports {X_in[6]}] [get_ports {X_in[5]}] [get_ports {X_in[4]}] [get_ports {X_in[3]}] [get_ports {X_in[2]}] [get_ports {X_in[1]}] [get_ports {X_in[0]}] [get_ports {W_in[3]}] [get_ports {W_in[2]}] [get_ports {W_in[1]}] [get_ports {W_in[0]}]]  -to [list [get_ports {Y_out[255]}] [get_ports {Y_out[254]}] [get_ports {Y_out[253]}] [get_ports {Y_out[252]}] [get_ports {Y_out[251]}] [get_ports {Y_out[250]}] [get_ports {Y_out[249]}] [get_ports {Y_out[248]}] [get_ports {Y_out[247]}] [get_ports {Y_out[246]}] [get_ports {Y_out[245]}] [get_ports {Y_out[244]}] [get_ports {Y_out[243]}] [get_ports {Y_out[242]}] [get_ports {Y_out[241]}] [get_ports {Y_out[240]}] [get_ports {Y_out[239]}] [get_ports {Y_out[238]}] [get_ports {Y_out[237]}] [get_ports {Y_out[236]}] [get_ports {Y_out[235]}] [get_ports {Y_out[234]}] [get_ports {Y_out[233]}] [get_ports {Y_out[232]}] [get_ports {Y_out[231]}] [get_ports {Y_out[230]}] [get_ports {Y_out[229]}] [get_ports {Y_out[228]}] [get_ports {Y_out[227]}] [get_ports {Y_out[226]}] [get_ports {Y_out[225]}] [get_ports {Y_out[224]}] [get_ports {Y_out[223]}] [get_ports {Y_out[222]}] [get_ports {Y_out[221]}] [get_ports {Y_out[220]}] [get_ports {Y_out[219]}] [get_ports {Y_out[218]}] [get_ports {Y_out[217]}] [get_ports {Y_out[216]}] [get_ports {Y_out[215]}] [get_ports {Y_out[214]}] [get_ports {Y_out[213]}] [get_ports {Y_out[212]}] [get_ports {Y_out[211]}] [get_ports {Y_out[210]}] [get_ports {Y_out[209]}] [get_ports {Y_out[208]}] [get_ports {Y_out[207]}] [get_ports {Y_out[206]}] [get_ports {Y_out[205]}] [get_ports {Y_out[204]}] [get_ports {Y_out[203]}] [get_ports {Y_out[202]}] [get_ports {Y_out[201]}] [get_ports {Y_out[200]}] [get_ports {Y_out[199]}] [get_ports {Y_out[198]}] [get_ports {Y_out[197]}] [get_ports {Y_out[196]}] [get_ports {Y_out[195]}] [get_ports {Y_out[194]}] [get_ports {Y_out[193]}] [get_ports {Y_out[192]}] [get_ports {Y_out[191]}] [get_ports {Y_out[190]}] [get_ports {Y_out[189]}] [get_ports {Y_out[188]}] [get_ports {Y_out[187]}] [get_ports {Y_out[186]}] [get_ports {Y_out[185]}] [get_ports {Y_out[184]}] [get_ports {Y_out[183]}] [get_ports {Y_out[182]}] [get_ports {Y_out[181]}] [get_ports {Y_out[180]}] [get_ports {Y_out[179]}] [get_ports {Y_out[178]}] [get_ports {Y_out[177]}] [get_ports {Y_out[176]}] [get_ports {Y_out[175]}] [get_ports {Y_out[174]}] [get_ports {Y_out[173]}] [get_ports {Y_out[172]}] [get_ports {Y_out[171]}] [get_ports {Y_out[170]}] [get_ports {Y_out[169]}] [get_ports {Y_out[168]}] [get_ports {Y_out[167]}] [get_ports {Y_out[166]}] [get_ports {Y_out[165]}] [get_ports {Y_out[164]}] [get_ports {Y_out[163]}] [get_ports {Y_out[162]}] [get_ports {Y_out[161]}] [get_ports {Y_out[160]}] [get_ports {Y_out[159]}] [get_ports {Y_out[158]}] [get_ports {Y_out[157]}] [get_ports {Y_out[156]}] [get_ports {Y_out[155]}] [get_ports {Y_out[154]}] [get_ports {Y_out[153]}] [get_ports {Y_out[152]}] [get_ports {Y_out[151]}] [get_ports {Y_out[150]}] [get_ports {Y_out[149]}] [get_ports {Y_out[148]}] [get_ports {Y_out[147]}] [get_ports {Y_out[146]}] [get_ports {Y_out[145]}] [get_ports {Y_out[144]}] [get_ports {Y_out[143]}] [get_ports {Y_out[142]}] [get_ports {Y_out[141]}] [get_ports {Y_out[140]}] [get_ports {Y_out[139]}] [get_ports {Y_out[138]}] [get_ports {Y_out[137]}] [get_ports {Y_out[136]}] [get_ports {Y_out[135]}] [get_ports {Y_out[134]}] [get_ports {Y_out[133]}] [get_ports {Y_out[132]}] [get_ports {Y_out[131]}] [get_ports {Y_out[130]}] [get_ports {Y_out[129]}] [get_ports {Y_out[128]}] [get_ports {Y_out[127]}] [get_ports {Y_out[126]}] [get_ports {Y_out[125]}] [get_ports {Y_out[124]}] [get_ports {Y_out[123]}] [get_ports {Y_out[122]}] [get_ports {Y_out[121]}] [get_ports {Y_out[120]}] [get_ports {Y_out[119]}] [get_ports {Y_out[118]}] [get_ports {Y_out[117]}] [get_ports {Y_out[116]}] [get_ports {Y_out[115]}] [get_ports {Y_out[114]}] [get_ports {Y_out[113]}] [get_ports {Y_out[112]}] [get_ports {Y_out[111]}] [get_ports {Y_out[110]}] [get_ports {Y_out[109]}] [get_ports {Y_out[108]}] [get_ports {Y_out[107]}] [get_ports {Y_out[106]}] [get_ports {Y_out[105]}] [get_ports {Y_out[104]}] [get_ports {Y_out[103]}] [get_ports {Y_out[102]}] [get_ports {Y_out[101]}] [get_ports {Y_out[100]}] [get_ports {Y_out[99]}] [get_ports {Y_out[98]}] [get_ports {Y_out[97]}] [get_ports {Y_out[96]}] [get_ports {Y_out[95]}] [get_ports {Y_out[94]}] [get_ports {Y_out[93]}] [get_ports {Y_out[92]}] [get_ports {Y_out[91]}] [get_ports {Y_out[90]}] [get_ports {Y_out[89]}] [get_ports {Y_out[88]}] [get_ports {Y_out[87]}] [get_ports {Y_out[86]}] [get_ports {Y_out[85]}] [get_ports {Y_out[84]}] [get_ports {Y_out[83]}] [get_ports {Y_out[82]}] [get_ports {Y_out[81]}] [get_ports {Y_out[80]}] [get_ports {Y_out[79]}] [get_ports {Y_out[78]}] [get_ports {Y_out[77]}] [get_ports {Y_out[76]}] [get_ports {Y_out[75]}] [get_ports {Y_out[74]}] [get_ports {Y_out[73]}] [get_ports {Y_out[72]}] [get_ports {Y_out[71]}] [get_ports {Y_out[70]}] [get_ports {Y_out[69]}] [get_ports {Y_out[68]}] [get_ports {Y_out[67]}] [get_ports {Y_out[66]}] [get_ports {Y_out[65]}] [get_ports {Y_out[64]}] [get_ports {Y_out[63]}] [get_ports {Y_out[62]}] [get_ports {Y_out[61]}] [get_ports {Y_out[60]}] [get_ports {Y_out[59]}] [get_ports {Y_out[58]}] [get_ports {Y_out[57]}] [get_ports {Y_out[56]}] [get_ports {Y_out[55]}] [get_ports {Y_out[54]}] [get_ports {Y_out[53]}] [get_ports {Y_out[52]}] [get_ports {Y_out[51]}] [get_ports {Y_out[50]}] [get_ports {Y_out[49]}] [get_ports {Y_out[48]}] [get_ports {Y_out[47]}] [get_ports {Y_out[46]}] [get_ports {Y_out[45]}] [get_ports {Y_out[44]}] [get_ports {Y_out[43]}] [get_ports {Y_out[42]}] [get_ports {Y_out[41]}] [get_ports {Y_out[40]}] [get_ports {Y_out[39]}] [get_ports {Y_out[38]}] [get_ports {Y_out[37]}] [get_ports {Y_out[36]}] [get_ports {Y_out[35]}] [get_ports {Y_out[34]}] [get_ports {Y_out[33]}] [get_ports {Y_out[32]}] [get_ports {Y_out[31]}] [get_ports {Y_out[30]}] [get_ports {Y_out[29]}] [get_ports {Y_out[28]}] [get_ports {Y_out[27]}] [get_ports {Y_out[26]}] [get_ports {Y_out[25]}] [get_ports {Y_out[24]}] [get_ports {Y_out[23]}] [get_ports {Y_out[22]}] [get_ports {Y_out[21]}] [get_ports {Y_out[20]}] [get_ports {Y_out[19]}] [get_ports {Y_out[18]}] [get_ports {Y_out[17]}] [get_ports {Y_out[16]}] [get_ports {Y_out[15]}] [get_ports {Y_out[14]}] [get_ports {Y_out[13]}] [get_ports {Y_out[12]}] [get_ports {Y_out[11]}] [get_ports {Y_out[10]}] [get_ports {Y_out[9]}] [get_ports {Y_out[8]}] [get_ports {Y_out[7]}] [get_ports {Y_out[6]}] [get_ports {Y_out[5]}] [get_ports {Y_out[4]}] [get_ports {Y_out[3]}] [get_ports {Y_out[2]}] [get_ports {Y_out[1]}] [get_ports {Y_out[0]}]]
group_path -name REGIN  -from [get_ports rst]
group_path -name REGIN  -from [list [get_ports {X_in[63]}] [get_ports {X_in[62]}] [get_ports {X_in[61]}] [get_ports {X_in[60]}] [get_ports {X_in[59]}] [get_ports {X_in[58]}] [get_ports {X_in[57]}] [get_ports {X_in[56]}] [get_ports {X_in[55]}] [get_ports {X_in[54]}] [get_ports {X_in[53]}] [get_ports {X_in[52]}] [get_ports {X_in[51]}] [get_ports {X_in[50]}] [get_ports {X_in[49]}] [get_ports {X_in[48]}] [get_ports {X_in[47]}] [get_ports {X_in[46]}] [get_ports {X_in[45]}] [get_ports {X_in[44]}] [get_ports {X_in[43]}] [get_ports {X_in[42]}] [get_ports {X_in[41]}] [get_ports {X_in[40]}] [get_ports {X_in[39]}] [get_ports {X_in[38]}] [get_ports {X_in[37]}] [get_ports {X_in[36]}] [get_ports {X_in[35]}] [get_ports {X_in[34]}] [get_ports {X_in[33]}] [get_ports {X_in[32]}] [get_ports {X_in[31]}] [get_ports {X_in[30]}] [get_ports {X_in[29]}] [get_ports {X_in[28]}] [get_ports {X_in[27]}] [get_ports {X_in[26]}] [get_ports {X_in[25]}] [get_ports {X_in[24]}] [get_ports {X_in[23]}] [get_ports {X_in[22]}] [get_ports {X_in[21]}] [get_ports {X_in[20]}] [get_ports {X_in[19]}] [get_ports {X_in[18]}] [get_ports {X_in[17]}] [get_ports {X_in[16]}] [get_ports {X_in[15]}] [get_ports {X_in[14]}] [get_ports {X_in[13]}] [get_ports {X_in[12]}] [get_ports {X_in[11]}] [get_ports {X_in[10]}] [get_ports {X_in[9]}] [get_ports {X_in[8]}] [get_ports {X_in[7]}] [get_ports {X_in[6]}] [get_ports {X_in[5]}] [get_ports {X_in[4]}] [get_ports {X_in[3]}] [get_ports {X_in[2]}] [get_ports {X_in[1]}] [get_ports {X_in[0]}] [get_ports {W_in[3]}] [get_ports {W_in[2]}] [get_ports {W_in[1]}] [get_ports {W_in[0]}]]
group_path -name REGOUT  -to [list [get_ports {Y_out[255]}] [get_ports {Y_out[254]}] [get_ports {Y_out[253]}] [get_ports {Y_out[252]}] [get_ports {Y_out[251]}] [get_ports {Y_out[250]}] [get_ports {Y_out[249]}] [get_ports {Y_out[248]}] [get_ports {Y_out[247]}] [get_ports {Y_out[246]}] [get_ports {Y_out[245]}] [get_ports {Y_out[244]}] [get_ports {Y_out[243]}] [get_ports {Y_out[242]}] [get_ports {Y_out[241]}] [get_ports {Y_out[240]}] [get_ports {Y_out[239]}] [get_ports {Y_out[238]}] [get_ports {Y_out[237]}] [get_ports {Y_out[236]}] [get_ports {Y_out[235]}] [get_ports {Y_out[234]}] [get_ports {Y_out[233]}] [get_ports {Y_out[232]}] [get_ports {Y_out[231]}] [get_ports {Y_out[230]}] [get_ports {Y_out[229]}] [get_ports {Y_out[228]}] [get_ports {Y_out[227]}] [get_ports {Y_out[226]}] [get_ports {Y_out[225]}] [get_ports {Y_out[224]}] [get_ports {Y_out[223]}] [get_ports {Y_out[222]}] [get_ports {Y_out[221]}] [get_ports {Y_out[220]}] [get_ports {Y_out[219]}] [get_ports {Y_out[218]}] [get_ports {Y_out[217]}] [get_ports {Y_out[216]}] [get_ports {Y_out[215]}] [get_ports {Y_out[214]}] [get_ports {Y_out[213]}] [get_ports {Y_out[212]}] [get_ports {Y_out[211]}] [get_ports {Y_out[210]}] [get_ports {Y_out[209]}] [get_ports {Y_out[208]}] [get_ports {Y_out[207]}] [get_ports {Y_out[206]}] [get_ports {Y_out[205]}] [get_ports {Y_out[204]}] [get_ports {Y_out[203]}] [get_ports {Y_out[202]}] [get_ports {Y_out[201]}] [get_ports {Y_out[200]}] [get_ports {Y_out[199]}] [get_ports {Y_out[198]}] [get_ports {Y_out[197]}] [get_ports {Y_out[196]}] [get_ports {Y_out[195]}] [get_ports {Y_out[194]}] [get_ports {Y_out[193]}] [get_ports {Y_out[192]}] [get_ports {Y_out[191]}] [get_ports {Y_out[190]}] [get_ports {Y_out[189]}] [get_ports {Y_out[188]}] [get_ports {Y_out[187]}] [get_ports {Y_out[186]}] [get_ports {Y_out[185]}] [get_ports {Y_out[184]}] [get_ports {Y_out[183]}] [get_ports {Y_out[182]}] [get_ports {Y_out[181]}] [get_ports {Y_out[180]}] [get_ports {Y_out[179]}] [get_ports {Y_out[178]}] [get_ports {Y_out[177]}] [get_ports {Y_out[176]}] [get_ports {Y_out[175]}] [get_ports {Y_out[174]}] [get_ports {Y_out[173]}] [get_ports {Y_out[172]}] [get_ports {Y_out[171]}] [get_ports {Y_out[170]}] [get_ports {Y_out[169]}] [get_ports {Y_out[168]}] [get_ports {Y_out[167]}] [get_ports {Y_out[166]}] [get_ports {Y_out[165]}] [get_ports {Y_out[164]}] [get_ports {Y_out[163]}] [get_ports {Y_out[162]}] [get_ports {Y_out[161]}] [get_ports {Y_out[160]}] [get_ports {Y_out[159]}] [get_ports {Y_out[158]}] [get_ports {Y_out[157]}] [get_ports {Y_out[156]}] [get_ports {Y_out[155]}] [get_ports {Y_out[154]}] [get_ports {Y_out[153]}] [get_ports {Y_out[152]}] [get_ports {Y_out[151]}] [get_ports {Y_out[150]}] [get_ports {Y_out[149]}] [get_ports {Y_out[148]}] [get_ports {Y_out[147]}] [get_ports {Y_out[146]}] [get_ports {Y_out[145]}] [get_ports {Y_out[144]}] [get_ports {Y_out[143]}] [get_ports {Y_out[142]}] [get_ports {Y_out[141]}] [get_ports {Y_out[140]}] [get_ports {Y_out[139]}] [get_ports {Y_out[138]}] [get_ports {Y_out[137]}] [get_ports {Y_out[136]}] [get_ports {Y_out[135]}] [get_ports {Y_out[134]}] [get_ports {Y_out[133]}] [get_ports {Y_out[132]}] [get_ports {Y_out[131]}] [get_ports {Y_out[130]}] [get_ports {Y_out[129]}] [get_ports {Y_out[128]}] [get_ports {Y_out[127]}] [get_ports {Y_out[126]}] [get_ports {Y_out[125]}] [get_ports {Y_out[124]}] [get_ports {Y_out[123]}] [get_ports {Y_out[122]}] [get_ports {Y_out[121]}] [get_ports {Y_out[120]}] [get_ports {Y_out[119]}] [get_ports {Y_out[118]}] [get_ports {Y_out[117]}] [get_ports {Y_out[116]}] [get_ports {Y_out[115]}] [get_ports {Y_out[114]}] [get_ports {Y_out[113]}] [get_ports {Y_out[112]}] [get_ports {Y_out[111]}] [get_ports {Y_out[110]}] [get_ports {Y_out[109]}] [get_ports {Y_out[108]}] [get_ports {Y_out[107]}] [get_ports {Y_out[106]}] [get_ports {Y_out[105]}] [get_ports {Y_out[104]}] [get_ports {Y_out[103]}] [get_ports {Y_out[102]}] [get_ports {Y_out[101]}] [get_ports {Y_out[100]}] [get_ports {Y_out[99]}] [get_ports {Y_out[98]}] [get_ports {Y_out[97]}] [get_ports {Y_out[96]}] [get_ports {Y_out[95]}] [get_ports {Y_out[94]}] [get_ports {Y_out[93]}] [get_ports {Y_out[92]}] [get_ports {Y_out[91]}] [get_ports {Y_out[90]}] [get_ports {Y_out[89]}] [get_ports {Y_out[88]}] [get_ports {Y_out[87]}] [get_ports {Y_out[86]}] [get_ports {Y_out[85]}] [get_ports {Y_out[84]}] [get_ports {Y_out[83]}] [get_ports {Y_out[82]}] [get_ports {Y_out[81]}] [get_ports {Y_out[80]}] [get_ports {Y_out[79]}] [get_ports {Y_out[78]}] [get_ports {Y_out[77]}] [get_ports {Y_out[76]}] [get_ports {Y_out[75]}] [get_ports {Y_out[74]}] [get_ports {Y_out[73]}] [get_ports {Y_out[72]}] [get_ports {Y_out[71]}] [get_ports {Y_out[70]}] [get_ports {Y_out[69]}] [get_ports {Y_out[68]}] [get_ports {Y_out[67]}] [get_ports {Y_out[66]}] [get_ports {Y_out[65]}] [get_ports {Y_out[64]}] [get_ports {Y_out[63]}] [get_ports {Y_out[62]}] [get_ports {Y_out[61]}] [get_ports {Y_out[60]}] [get_ports {Y_out[59]}] [get_ports {Y_out[58]}] [get_ports {Y_out[57]}] [get_ports {Y_out[56]}] [get_ports {Y_out[55]}] [get_ports {Y_out[54]}] [get_ports {Y_out[53]}] [get_ports {Y_out[52]}] [get_ports {Y_out[51]}] [get_ports {Y_out[50]}] [get_ports {Y_out[49]}] [get_ports {Y_out[48]}] [get_ports {Y_out[47]}] [get_ports {Y_out[46]}] [get_ports {Y_out[45]}] [get_ports {Y_out[44]}] [get_ports {Y_out[43]}] [get_ports {Y_out[42]}] [get_ports {Y_out[41]}] [get_ports {Y_out[40]}] [get_ports {Y_out[39]}] [get_ports {Y_out[38]}] [get_ports {Y_out[37]}] [get_ports {Y_out[36]}] [get_ports {Y_out[35]}] [get_ports {Y_out[34]}] [get_ports {Y_out[33]}] [get_ports {Y_out[32]}] [get_ports {Y_out[31]}] [get_ports {Y_out[30]}] [get_ports {Y_out[29]}] [get_ports {Y_out[28]}] [get_ports {Y_out[27]}] [get_ports {Y_out[26]}] [get_ports {Y_out[25]}] [get_ports {Y_out[24]}] [get_ports {Y_out[23]}] [get_ports {Y_out[22]}] [get_ports {Y_out[21]}] [get_ports {Y_out[20]}] [get_ports {Y_out[19]}] [get_ports {Y_out[18]}] [get_ports {Y_out[17]}] [get_ports {Y_out[16]}] [get_ports {Y_out[15]}] [get_ports {Y_out[14]}] [get_ports {Y_out[13]}] [get_ports {Y_out[12]}] [get_ports {Y_out[11]}] [get_ports {Y_out[10]}] [get_ports {Y_out[9]}] [get_ports {Y_out[8]}] [get_ports {Y_out[7]}] [get_ports {Y_out[6]}] [get_ports {Y_out[5]}] [get_ports {Y_out[4]}] [get_ports {Y_out[3]}] [get_ports {Y_out[2]}] [get_ports {Y_out[1]}] [get_ports {Y_out[0]}]]
set_false_path   -from [get_ports rst]
